aoc2018.org
:setup:
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: post
#+todo: todo | edit finished
#+PROPERTY: header-args :exports code :results output
:end:
#+title:  Advent of Code 2018
#+author: Piotr Kaznowski
#+date:   2020-01-03

* edit Day 01: Chronal Calibration :apply:loop:cycle:reductions:
CLOSED: [2020-01-10 Fri 10:55]
:PROPERTIES:
:EXPORT_FILE_NAME: day01
:EXPORT_HUGO_WEIGHT: 101
:EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :summary "Apply, loop and reductions"
:END:
** Puzzle summary

https://adventofcode.com/2018/day/1

As input we get integers representing change of "frequency". To count final frequency we need to add all changes starting from 0. For example changes notes as ~+1, -2, +3, +1~ would give final frequency ~3~.
 
** Descriptions               :noexport:
*** Part 1
"We've detected some temporal anomalies," one of Santa's Elves at the Temporal Anomaly Research and Detection Instrument Station tells you. She sounded pretty worried when she called you down here. "At 500-year intervals into the past, someone has been changing Santa's history!"

"The good news is that the changes won't propagate to our time stream for another 25 days, and we have a device" - she attaches something to your wrist - "that will let you fix the changes with no such propagation delay. It's configured to send you 500 years further into the past every few days; that was the best we could do on such short notice."

"The bad news is that we are detecting roughly fifty anomalies throughout time; the device will indicate fixed anomalies with stars. The other bad news is that we only have one device and you're the best person for the job! Good lu--" She taps a button on the device and you suddenly feel like you're falling. To save Christmas, you need to get all fifty stars by December 25th.

Collect stars by solving puzzles. Two puzzles will be made available on each day in the Advent calendar; the second puzzle is unlocked when you complete the first. Each puzzle grants one star. Good luck!

After feeling like you've been falling for a few minutes, you look at the device's tiny screen. "Error: Device must be calibrated before first use. Frequency drift detected. Cannot maintain destination lock." Below the message, the device shows a sequence of changes in frequency (your puzzle input). A value like +6 means the current frequency increases by 6; a value like -3 means the current frequency decreases by 3.

For example, if the device displays frequency changes of +1, -2, +3, +1, then starting from a frequency of zero, the following changes would occur:

Current frequency  0, change of +1; resulting frequency  1.
Current frequency  1, change of -2; resulting frequency -1.
Current frequency -1, change of +3; resulting frequency  2.
Current frequency  2, change of +1; resulting frequency  3.

In this example, the resulting frequency is 3.

Here are other example situations:

+1, +1, +1 results in  3
+1, +1, -2 results in  0
-1, -2, -3 results in -6

Starting with a frequency of zero, what is the resulting frequency after all of the changes in frequency have been applied?
*** Part 2
You notice that the device repeats the same frequency change list over and over. To calibrate the device, you need to find the first frequency it reaches twice.

For example, using the same list of changes above, the device would loop as follows:

#+begin_example
Current frequency  0, change of +1; resulting frequency  1.
Current frequency  1, change of -2; resulting frequency -1.
Current frequency -1, change of +3; resulting frequency  2.
Current frequency  2, change of +1; resulting frequency  3.
(At this point, the device continues from the start of the list.)
Current frequency  3, change of +1; resulting frequency  4.
Current frequency  4, change of -2; resulting frequency  2, which has already been seen.
#+end_example

In this example, the first frequency reached twice is 2. Note that your device might need to repeat its list of frequency changes many times before a duplicate frequency is found, and that duplicates might be found while in the middle of processing the list.

Here are other examples:

#+begin_example
+1, -1 first reaches 0 twice.
+3, +3, +4, -2, -4 first reaches 10 twice.
-6, +3, +8, +5, -6 first reaches 5 twice.
+7, +7, -2, -7, -4 first reaches 14 twice.
#+end_example

What is the first frequency your device reaches twice?

** Solutions
[[https://gitlab.com/pkaznowski/aoc18/blob/master/src/aoc18/puzzle01.clj][Check full solution in the repo]]

*** Namespace
Since I would always use some helpers to read input, I will further on export ~namespace~ definition only when other requirements are needed.

#+name: day01_ns
#+begin_src clojure :noweb-ref code01
  (ns aoc18.puzzle01 (:require [aoc18.utils :refer [input->ints]]
                               [clojure.repl :refer [doc]]))

#+end_src

#+name: day01_test_ns
#+begin_src clojure :noweb-ref test01
(ns aoc18.puzzle01-test
  (:require [clojure.test :refer :all]
            [aoc18.puzzle01 :refer [find-repeated-freq]]))

#+end_src

*** Find repeated requency (part 2)
Since part 1 consists on merely applying... ~apply~ to the collection of integers let's skip to part 2 immediately.

The task is to find first frequency which is reached twice. We would cycle through the input putting each frequency to a ~hash-map~. If given frequency is already there, that'd be solution, if not, we have to loop more.

First I had to understand the ~loop~ form in Clojure. Recursion, as it seems, is not necessarily implemented through invoking the function in it's declaration but by using ~recur~ special form inside a loop. Loop takes arguments which and exactly the same structure of args has to be passed to recur.

In our loop we need input which will be cycled and concecutive frequencies counted by adding next change to the current frequency starting with 0. To implement simple loop operating on consecutive elements of a seq we may use destructing notation which takes first element and the rest from a seq, like this. Then, if certain condition is not satisfied we would recur passing the rest or return value:

#+name: day01_loop_example
#+begin_src clojure :exports code :results silent
  (loop [[first_el & the_rest] [0 1 2 3 4]
         increased_by_1 []]
    (if first_el
      (recur the_rest (conj increased_by_1 (inc first_el)))
      increased_by_1))   ;; => [1 2 3 4 5]

#+end_src 

Let's apply this to our case:

#+name: day01_find_repeated_freq
#+begin_src clojure :noweb-ref code01
  (defn find-repeated-freq [input]
    (loop [[freq & rest] (reductions + (cycle input))
           seen #{0}]
      (if (contains? seen freq)   ; we might write (seen freq) as well
        freq
        (recur rest (conj seen freq)))))

#+end_src

This func should behave like this:

#+name: day01_find_repeated_freq_test
#+begin_src clojure :noweb-ref test01 :exports code
(deftest find-repeated-freq-test
  (testing "should match exemplary data"
    (is (= 0  (find-repeated-freq [1 -1])))
    (is (= 10 (find-repeated-freq [3 3 4 -2 -4])))
    (is (= 5  (find-repeated-freq [-6 3 8 5 -6])))
    (is (= 14 (find-repeated-freq [7 7 -2 -7 -4])))))

#+end_src

~reductions~ is where magic happens. Let's look at the [[https://clojuredocs.org/clojure.core/reductions][docs]]:

#+name: day01_doc_reductions
#+begin_src clojure :exports results
(doc reductions)
#+end_src

#+RESULTS: day01_doc_reductions
: -------------------------
: clojure.core/reductions
: ([f coll] [f init coll])
:   Returns a lazy seq of the intermediate values of the reduction (as
:   per reduce) of coll by f, starting with init.

So ~reductions~ give us "snapshots" of consecutive moves of ~reduce~. For example reduceing integers from 0 to 4 with sum (~+~) would give ~10~. Using reductions would return seq of every step, namely:
1. ~0~,
2. ~0 + 1 = 1~,
3. ~1 + 2 = 3~,
4. ~3 + 3 = 6~,
5. ~6 + 4 = 10~.

#+name: day01_reductions_example
#+begin_src clojure :exports code :results output
  (vec (reductions + (range 5))) ;; => [0 1 3 6 10]
  (reduce + (range 5))           ;; => 10
#+end_src

#+RESULTS: day01_reductions_example
: [0 1 3 6 10]
: 10

*** Putting things together
Our solution will be as follows:

#+name: day01_solve
#+begin_src clojure :noweb-ref code01
  (defn solve []
    (let [input (input->ints "day01")]
      {:part1 (time (apply + input))
       :part2 (time (find-repeated-freq input))}))
#+end_src

#+name: day01_tangle
#+begin_src clojure :noweb yes :tangle src/aoc18/puzzle01.clj :exports none :results silent
  <<code01>>
#+end_src

#+name: day01_tangle
#+begin_src clojure :noweb yes :tangle test/aoc18/puzzle01_test.clj :exports none :results silent
  <<test01>>
#+end_src

Finally let's run tests:

#+name: day01_tests
#+begin_src clojure :exports results :results output
(require '[clojure.test :refer [run-tests]] 'aoc18.puzzle01-test)
(run-tests 'aoc18.puzzle01-test)
#+end_src

#+RESULTS: day01_tests
: 
: Testing aoc18.puzzle01-test
: 
: Ran 1 tests containing 4 assertions.
: 0 failures, 0 errors.

And get the answer:

#+name: day01_results
#+begin_src clojure :ns aoc18.puzzle01 :exports results :results code
  (solve)
#+end_src

#+RESULTS: day01_results
#+begin_src clojure
"Elapsed time: 0.283155 msecs"
"Elapsed time: 209.2901 msecs"
{:part1 595, :part2 80598}
#+end_src

** COMMENT Commentary
Discussion about apply and reduce

